<template>
  <div>
    <Form/>
    <div class="notes">
      <h3>Примечания</h3>
      <p>
        Для перехода на страницу со списком пользователей введите почту и пароль, которые указаны в скобках возле инпутов.
      </p>
      <p>
        В этой работе демонстрируется работа фронтенда, поэтому истинная авторизация мокается (нет вычисления хэша на сервере и вот это все). Логин и пароль сверяются на фронте с данными полученными в явном виде с сервера.
      </p>
      <p>
        Используется сервис <a href="https://my-json-server.typicode.com/">my-json-server.typicode.com</a>, который эмулирует работу с сервером. Первоначальные данные загружаются с сервера, но изменение, добавление и редактирование не вызывают изменений на сервере. Сервис предоставляет ответы, как если бы данные на сервере изменялись.
      </p>

    </div>
  </div>
</template>

<script>
// @ is an alias to /src
import Form from '@/components/Form.vue'

export default {
  name: 'Home',
  components: {
    Form
  }
}
</script>

<style lang="scss" scoped>
  .notes {
    padding: 10px;
  }
</style>
